Revit 2027 API
ResourceVersionStatus Enumeration
 An enum indicating whether a resource is current or out of date.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum ResourceVersionStatus
Public Enumeration ResourceVersionStatus
public enum class ResourceVersionStatus
type ResourceVersionStatus
Members
Member name | Value | Description
Current | 0 |  The resource is up-to-date; this is is the most recent version of the resource.
OutOfDate | 1 |  This is not the most recent version of the resource.
Unknown | 2 |  It is not known whether the resource is current.
See Also
Reference
Autodesk.Revit.DB Namespace